* McDowell (2020) 14SA
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | mcdowell_2021_14sa
Alternate name                        | 
Data source                           |  McDowell, I. E., Humphrey, N. F., Harper, J. T., and Meierbachtol, T. W.: The cooling signature of basal crevasses in a hard-bedded region of the Greenland Ice Sheet, The Cryosphere, 15, 897–907, https://doi.org/10.5194/tc-15-897-2021, 2021.
Drill year(s)                         | 2014
Data year(s)                          | August 2015
Longitude [°E]                        | -49.57241703
Latitude [°N]                         | 67.180997
Approximate location name             | 
Location source                       | 
Ice thickness [m]                     | 674
Ice thickness year                    | 2014
Ice thickness source                  | See raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder
Surface velocity [m yr^-1]            | 
Surface velocity year                 | 
Surface velocity source               | 
Measured from: Top, Bottom, Relative  | B
Depth of top measurement [m]          | 72
Depth of bottom measurement [m]       | 672
#+end_example

** Temperature

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Thickness

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)
 
** Location

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :exports none
import numpy as np
import pandas as pd

df_bot = pd.read_csv("meta.bsv", sep="|", index_col=0, header=None, squeeze=True)
thick = np.float(df_bot['Ice thickness [m]'])
df = pd.read_csv('data_bottom.csv')
df = df[df.columns[::-1]]  # swap from d,t to t,d
df['d'] = thick - df['d']
df.to_csv('data.csv', index=False)
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k2
#+END_SRC

#+RESULTS:
|                   t |     d |
|     -10.42292946256 |  72.0 |
|     -10.62374320216 |  92.0 |
| -10.762056941760001 | 112.0 |
| -10.837870681360002 | 132.0 |
|     -10.91368442096 | 152.0 |
|     -10.98949816056 | 172.0 |
| -10.877811900160001 | 192.0 |
|     -10.89112563976 | 212.0 |
| -10.779439379360001 | 232.0 |
|     -10.73025311896 | 252.0 |
| -10.618566858560001 | 272.0 |
|     -10.56938059816 | 292.0 |
|     -10.52019433776 | 312.0 |
|     -10.53350807736 | 332.0 |
| -10.296821816960001 | 352.0 |
|      -9.99763555656 | 372.0 |
|      -9.51094929616 | 392.0 |
|      -9.02426303576 | 412.0 |
|      -8.41257677536 | 432.0 |
|  -7.925890514960001 | 452.0 |
|  -7.376704254560001 | 472.0 |
|      -6.82751799416 | 492.0 |
|  -6.153331733759999 | 512.0 |
| -5.7849886035599996 | 522.0 |
|      -5.60414547336 | 532.0 |
|      -5.17330234316 | 542.0 |
|      -4.80495921296 | 552.0 |
|      -4.43661608276 | 562.0 |
|      -4.00577295256 | 572.0 |
|      -3.57492982236 | 582.0 |
| -3.2065866921599997 | 592.0 |
| -2.9007435619599997 | 602.0 |
|      -2.34490043176 | 612.0 |
| -2.0390573015599998 | 622.0 |
|      -1.67071417136 | 632.0 |
|      -1.36487104116 | 642.0 |
|      -1.05902791096 | 652.0 |
| -0.8156847807600001 | 662.0 |
|      -0.57234165056 | 672.0 |

